# DimensionPerpendicularToView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..DimensionPerpendicularToView Property
BuiltInFailures..::..DimensionFailures Class See Also
---
The Dimension is perpendicular to the current view, and no longer valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DimensionPerpendicularToView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimensionPerpendicularToView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DimensionPerpendicularToView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace